
'''
作业3：求10阶乘
1*2*3*4*5*6*7*8*9*10
'''
# 定义变量jc ,n
n=1
jc=1
while n<=10:
# 循环体
    jc=jc*n
    n=n+1
# 输出结果
print(jc)

'''
作业4：求100以内能被3整除的数，并将作为列表输出
被3整除，余数为0，n%3=0
列表输出，列表追加，s.append(n)：在该元祖末尾追加n
'''
s=[]
for n in range(0,101):
    # 循环体
     if n%3==0:
        s.append(n)
        n=n+1
print(s)

'''
作业5：列表[1,2,3,4,3,4,2,5,5,8,9,7],将此列表去重，得到一个唯一元素的列表
[1,2,3,4,5,8,9,7]
定义一个新的列表，判断新的列表中有没有原列表中的元素，如果没有，追加到新的列表中
'''
q=[1,2,3,4,3,4,2,5,5,8,9,7]
m=[]
for i in q:
    # 循环体
    if i not in m:
        m.append(i)
print(m)

'''
作业6：求斐波那契数列 1 2 3 5 8 13 ……
1+2=3
2+3=5
3+5=8
5+8=13

'''
# num=[1,2]
# for i in range(2,6):
#     #循环体
#     num.insert(i,int(num[i-1])+int(num[i-2]))
#   print(num)

'''
作业7：求10000以内的质数
大于1，除了1和它本身以外，不能被其他自然数整除
'''
s=[]
for i in range(2,10001):
    j=2
    while (j<=(i/j)):
        if not(i%j):
            break
        j=j+1
    if (j>i/j):
        s.append(i)
    i=i+1
print(s)
